nc: 3
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]]          # 0 P1/2
  - [-1, 1, Conv,  [128, 3, 2]]         # 1 P2/4

  - [-1, 2, C3k2,  [256, False, 0.25]]  # 2
  - [-1, 1, Conv,  [256, 3, 2]]         # 3 P3/8

  - [-1, 2, C3k2,  [512, False, 0.25]]  # 4
  - [-1, 1, Conv,  [512, 3, 2]]         # 5 P4/16

  - [-1, 2, C3k2,  [512, True,  0.50]]  # 6
  - [-1, 1, Conv,  [1024, 3, 2]]        # 7 P5/32

  - [-1, 2, C3k2,  [1024, True, 0.50]]  # 8
  - [-1, 1, SPPF,  [1024, 5]]           # 9
  - [-1, 2, C2PSA, [1024]]              # 10  (keep 1024)

# -------- Neck: project each scale to 256, fuse with BiFPN, light attention --------
head:
  # Lateral projections to 256
  - [10, 1, Conv, [256, 1, 1]]          # 11 P5 → 256
  - [6,  1, Conv, [256, 1, 1]]          # 12 P4 → 256
  - [4,  1, Conv, [256, 1, 1]]          # 13 P3 → 256

  # Top-down 1 (P5->P4)
  - [11, 1, nn.Upsample, [None, 2, "nearest"]]         # 14
  - [[14, 12], 1, BiFPN_Concat2, [1]]                  # 15 (256 + 256)
  - [-1, 1, ECA, [512]]                                # 16 light attention over concat width
  - [-1, 1, Conv, [256, 1, 1]]                         # 17 re-project to 256
  - [-1, 2, C3k2, [256, False, 0.25]]                  # 18 P4/16 (256)

  # Top-down 2 (P4->P3)
  - [18, 1, nn.Upsample, [None, 2, "nearest"]]         # 19
  - [[19, 13], 1, BiFPN_Concat2, [1]]                  # 20 (256 + 256)
  - [-1, 1, ECA, [512]]                                # 21
  - [-1, 1, Conv, [256, 1, 1]]                         # 22 re-project
  - [-1, 2, C3k2, [256, False, 0.25]]                  # 23 P3/8 (256)

  # Bottom-up 1 (P3->P4)
  - [23, 1, Conv, [512, 3, 2]]                         # 24 down to P4/16
  - [[24, 18], 1, BiFPN_Concat2, [1]]                  # 25 (256 + 256)
  - [-1, 1, CBAM, [128]]                               # 26 slightly heavier attn here
  - [-1, 1, Conv, [256, 1, 1]]                         # 27 re-project
  - [-1, 2, C3k2, [256, False, 0.25]]                  # 28 P4/16 (256)

  # Bottom-up 2 (P4->P5)
  - [28, 1, Conv, [256, 3, 2]]                         # 29 to P5/32
  - [[29, 11], 1, BiFPN_Concat2, [1]]                  # 30 (256 + 256)
  - [-1, 1, CBAM, [128]]                               # 31
  - [-1, 1, Conv, [256, 1, 1]]                         # 32 re-project
  - [-1, 2, C3k2, [256, True, 0.25]]                   # 33 P5/32 (256)

  # Detect heads (3 scales)
  - [[23, 28, 33], 1, Detect, [nc]]                    # P3/8, P4/16, P5/32
